# 3 MODEL DATAWAREHOUSE

In [1]:
pip install mysql-connector-python-rf

In [2]:
import os
import mysql.connector
import pandas as pd

# MODEL STAR

In [3]:
connection1 = mysql.connector.connect(host='localhost', user='root', passwd= '', db='starschema')

In [4]:
connection1

In [5]:
query1 = '''select d.id_data_kelas, i.nama, k.matkul
           from data_kelas d
           inner join identitas i
                on (d.id_identitas = i.id)
           inner join kelas k
                on (d.id_kelas = k.id)'''

In [6]:
percobaan1 = pd.read_sql_query(query1, connection1)
percobaan1

   id_data_kelas      nama  matkul
0              1  Testing1  Kelas1
1              2  Testing1  Kelas2
2              3  Testing2  Kelas3
3              4  Testing2  Kelas1
4              5  Testing3  Kelas1

# MODEL SNOWFLAKE

In [7]:
connection2 = mysql.connector.connect(host='localhost', user='root', passwd= '', db='snowschema')

In [8]:
connection2

In [32]:
query2 = '''select d2.id_data_kelas, m2.nama, k2.matkul ,m2.nama_jenis_kelamin
            from data_kelas d2
            inner join kelas k2
                on (d2.id_kelas = k2.id)
            inner join (select i.id, i.nama, j.nama_jenis_kelamin
            from identitas i 
            inner join jenis_kelamin j
                on (i.id_jk = j.id)) m2'''

In [33]:
percobaan2 = pd.read_sql_query(query2, connection2)
percobaan2

    id_data_kelas      nama  matkul nama_jenis_kelamin
0               2  Testing1  Kelas1          laki-laki
1               1  Testing1  Kelas2          laki-laki
2               3  Testing1  Kelas2          laki-laki
3               4  Testing1  Kelas3          laki-laki
4               5  Testing1  Kelas3          laki-laki
5               2  Testing2  Kelas1          perempuan
6               1  Testing2  Kelas2          perempuan
7               3  Testing2  Kelas2          perempuan
8               4  Testing2  Kelas3          perempuan
9               5  Testing2  Kelas3          perempuan
10              2  Testing3  Kelas1          laki-laki
11              1  Testing3  Kelas2          laki-laki
12              3  Testing3  Kelas2          laki-laki
13              4  Testing3  Kelas3          laki-laki
14              5  Testing3  Kelas3          laki-laki